app/controllers/users_controller.rb

    def index
    # params["id"]
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    # params["id"]
    @user = User.find(params["id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]