app/controllers/weight_histories_controller.rb

SELECT "weight_histories".* FROM "weight_histories"
---
  def index
    @weight_histories = WeightHistory.all

INSERT INTO "weight_histories" ("user_id", "weight", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["weight", 22], ["memo", ""], ["created_at", "2022-08-17 14:07:34.207540"], ["updated_at", "2022-08-17 14:07:34.207540"]]
---
  def create
    @weight_history = WeightHistory.new(weight_history_params)

    respond_to do |format|
      if @weight_history.save

UPDATE "weight_histories" SET "weight" = ?, "updated_at" = ? WHERE "weight_histories"."id" = ?  [["weight", 333], ["updated_at", "2022-08-17 12:44:49.098975"], ["id", 1]]
---
  def update
     respond_to do |format|
      if @weight_history.update(weight_history_params)

DELETE FROM "weight_histories" WHERE "weight_histories"."id" = ?  [["id", 3]]
---
  def destroy
    @weight_history.destroy

SELECT "weight_histories".* FROM "weight_histories" WHERE "weight_histories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_weight_history
     #取得したIDをweight_historyに代入
      @weight_history = WeightHistory.find(params[:id])